import lombok.extern.slf4j.Slf4j;
import org.junit.Before;
import org.junit.Test;

import java.util.HashMap;
import java.util.Map;

@Slf4j
public class Lab2Part2Test {
    private FrequencyCryptanalyzer cryptanalyzer;

    private Map<Character, Double> frequncies1;
    private String testText1;

    private Map<Character, Double> frequencies2;
    private String testText2;

    private Map<Character, Double> frequencies3;
    private String testText3;

    private Map<Character, Double> frequencies4;
    private String testText4;

    private Map<Character, Double> frequencies5;
    private String testText5;

    @Before
    public void init(){
        cryptanalyzer = new FrequencyCryptanalyzer();

        frequncies1 = new HashMap<>()
        {{
            put('о', 0.1023); put('и', 0.0873); put('а', 0.0834);
            put('н', 0.0801); put('е', 0.0752); put('в', 0.0621);
            put('с',0.0602); put('т', 0.0562); put('р', 0.0497);
            put('к', 0.0347); put('я', 0.0334); put('д', 0.0327);
            put('м', 0.0242); put('ы', 0.0235); put('л', 0.0229);
            put('б', 0.0229); put('п', 0.0203); put('х', 0.0196);
            put('г', 0.0157); put('у', 0.0150); put('ч', 0.0137);
            put('з', 0.0098); put('й', 0.0098); put('ь', 0.0078);
            put('ж', 0.0072); put('ш', 0.0065); put('ю', 0.0065);
            put('ц', 0.0052); put('щ', 0.0039); put('ъ', 0.0020);
            put('э', 0.0013); put('ф', 0.0007); put('ё', 0.001);
        }};

        testText1 = "обнмчшйчшенчё мса амнбчцжц вмнбыуршчуа рнбцалчцжц обцлурчущш у бньнчуа влбшлнжуенвщую, цонбшлурчц-влбшлнжуенвщую у\n " +
                "цонбшлурчёю йшмше чш щцчлучнчлшсхчёю, цщншчвщую (гцбвщую) лншлбшю рцнччёю мнэвлруэ (лрм) \n" +
                "у чш цлмнсхчёю влбшлнжуенвщую (цонбшяуцччёю) чшобшрснчуаю. арсазлва ешвлхз «амнбчцэ лбушмё». \n" +
                "щ цвчцрчёг оцлнчяушсхчёг йшмшешг швав цлчцвалва: чшчнвнчун бшщнлчцдцгдцрёю фмшбцр оц цдтнщлшг \n" +
                "обцлурчущш чш йчшеулнсхчёю фмшснчуаю цл шибцмбцгцр дшйубцршчуа, цднвоненчун оцммнбыщу в рцймфюш \n" +
                "вус цдкнжц чшйчшенчуа (вцч) у мб. швав веулшзлва жудщуг вбнмвлрцг щшщ жсцдшсхчцжц, лшщ у бнжуцчшсхчцжц \n" +
                "вмнбыуршчуа рнбцалчёю обцлурчущцр, гцжфл обугнчалхва рц рвню румшю рцэч у щцчъсущлцр (щшщ амнбчёю, лшщ у цдёечёю). \n" +
                "швав угнзлва р вцвлшрн ррв бцввуу, вьш у щулша.р вьш цвчцрф швав вцвлшрсазл лаынсён (влбшлнжуенвщун) дцгдшбмубцркущу \n" +
                "(лд, вг. лаынсёэ дцгдшбмубцркущ) р-52ч у р-2ш, врнмнччён р 5 шрушщбёсхнр р вцвлшрн 8-э у 12-э рцймфьчёю шбгуэ, \n" +
                "щцлцбён шмгучувлбшлурчц оцмеучнчё дцнрцгф шрушяуцччцгф щцгшчмцршчуз ррв вьш. чш рццбфынчуу лд чшюцмалва щбёсшлён \n" +
                "бшщнлё (вг. щбёсшлша бшщнлш) рцймфьчцжц дшйубцршчуа (щбрд) дцсхьцэмшс��чцвлу (р амнбчцг у чнамнбчцг цвчшкнчуу) у шрушдцгдё. \n" +
                "р фвсцруаю губчцжц рбнгнчу дцнрцн мныфбвлрц влбшлнжуенвщцэ дцгдшбмубцрцечцэ шрушяунэ (вдш) вьш чн цвфкнвлрсанлва. в янсхз \n" +
                "оцммнбышчуа обшщлуенвщую чшрёщцр снлчцжц вцвлшрш цбжшчуйфзлва оцснлё оц осшчшг дцнрцэ оцмжцлцрщу. р фжбцышнгёэ онбуцм \n" +
                "бшйрулуа рцнччц-оцсулуенвщцэ цдвлшчцрщу усу р щбуйувчёю вулфшяуаю вдш онбнмшнлва р цонбшлурчцн оцмеучнчун цдтнмучнччцгф \n" +
                "влбшлнжуенвщцгф щцгшчмцршчуз рццбфынччёю вус (рв) вьш усу щцгшчмфзкнгф цдтнмучнччцжц щцгшчмцршчуа чш лрм. \n" +
                "цвчцрчён чшобшрснчуа бшйрулуа ��вав рв вьш: гцмнбчуйшяуа у обцмснчун вбцщш ищвосфшлшяуу лд р-52ч у р-2ш; \n" +
                "обучалун чш рццбфынчун чцрёю луоцр рёвцщцлцечёю щбрд, шрушдцгд у лд чцрцжц оцщцснчуа щ 2040 ж.\n";

        frequencies2 = new HashMap<>()
        {{
            put('о', 0.1173); put('а', 0.0880); put('н', 0.0775);
            put('и', 0.0733); put('е', 0.0723); put('т', 0.0608);
            put('р',0.0566); put('с', 0.0555); put('в', 0.0471);
            put('л', 0.0398); put('м', 0.0346); put('к', 0.0314);
            put('п', 0.0272); put('г', 0.0262); put('ы', 0.0251);
            put('б', 0.0199); put('я', 0.0199); put('у', 0.0188);
            put('д', 0.0178); put('й', 0.0126); put('ч', 0.0126);
            put('э', 0.0105); put('ц', 0.0094); put('х', 0.0094);
            put('з', 0.0094); put('ь', 0.0084); put('щ', 0.0042);
            put('ш', 0.0031); put('ж', 0.0021); put('ю', 0.0021);
            put('ф', 0.0013); put('ъ', 0.0007); put('ё', 0.0001);
        }};

        testText2 = "шцагщг иахшцкихпг м агюбцгэ ы бюпгшцх гцбэщбу фщъайъцхмх ы мбщжъ 1940-е йй. иах гмцхыщбэ клгшцхх клъщче, хээхйахабыгытхе хё\n" +
                "йъаэгщхх. ш шгэбйб щглгпг акмбыбьшцыб гайъщцхщч шцаъэхпбшо ьбюхцошд ы дьъащбу бюпгшцх эгмшхэгпощбу щъёгыхшхэбшцх, иах мбцбабу ыбёэбрщб\n" +
                "бьщбыаъэъщщбъ агёыхцхъ гцбэщбу фщъайъцхмх х щгклщб-цъещхлъшмбйб ибцъщжхгпг ы бюпгшцх дьъащбйб цбипхыщбйб жхмпг (дцж), ьбпйбъ ыаъэд\n" +
                "бшцгыпдд бцмачцчэ ыбиабш ъйб хшибпоёбыгщхд ы ыбъщщче жъпде.ы 1953 й. ы гайъщцхщъ щглгпхшо агюбцч иб иабэчтпъщщбу ьбючлъ кагщг. ёг 1958–1972\n" +
                "йй. ючпх ыыъьъщч ы фмшипкгцгжхн лъцчаъ хшшпъьбыгцъпошмхе аъгмцбаг,бьхщ хё мбцбаче ючп хэибацхабыгщ хё штг, бшцгпощчъ шмбщшцакхабыгщч х\n" +
                "ибшцабъщч шбюшцыъщщчэх шхпгэх. ы 1969 й. ы фшъушъ, ы 40 мэ бц шцбпхжч гайъщцхщч юкфщбш-гуаъшг, ючпг икяъщг пгюбагцбащгд\n" +
                "кшцгщбымг иб агьхбехэхлъшмбу иъаъагюбцмъ бюпклъщщбйб дьъащбйб цбипхыг (бдц), щб ы 1973 й. ибшпъ ычьъпъщхд бм. 1 мй ипкцбщхд бщг ючпг\n" +
                "ьъэбщцхабыгщг. ы 1974 й. ы пхэъ, ы 100 мэ м шъыъак бц юкфщбш-гуаъшг, ючпг икяъщг иъаыгд гцбэщгд фпъмцабшцгщжхд (гфш) «гцклг-1»,\n" +
                "ибшцабъщщгд иах ибэбях щъэъжмбу мбэигщхх «шхэъщш». гфш ючпг шбёьгщг щг бшщбыъ цдръпбыбьщ��йб аъгмцбаг щг иахабьщбэ кагщъ фпъмцахлъшмбу\n" +
                "эбящбшцон 357 эыц.\n";

        frequencies3 = new HashMap<>()
        {{
            put('о', 0.0973); put('и', 0.0873); put('н', 0.0802);
            put('е', 0.0766); put('с', 0.0713); put('а', 0.0686);
            put('р',0.0651); put('т', 0.0571); put('в', 0.0517);
            put('к', 0.0375); put('л', 0.0348); put('я', 0.0339);
            put('п', 0.0312); put('д', 0.0285); put('м', 0.0268);
            put('ы', 0.0205); put('у', 0.0187); put('г', 0.0169);
            put('х', 0.0152); put('ч', 0.0134); put('б', 0.0116);
            put('й', 0.0089); put('ж', 0.0080); put('з', 0.0071);
            put('ю', 0.0062); put('ц', 0.0054); put('ь', 0.0054);
            put('ф', 0.0045); put('э', 0.0027); put('ш', 0.0018);
            put('щ', 0.0018); put('ъ', 0.0007); put('ё', 0.0001);
        }};

        testText3 = "жфяюфялав уфяда ъ вяиелфй злиекиымшиъдфй щъыалфюдфй.ажу жфяеаряиувтыъв ла ъыеаыикмшиъдми м слфкфпиуиюци.д\n" +
                "ъыеаыикмшиъдмс фылфъвыъв ажу, фълфюлцс юффещнилмис дфыфецх вюувтыъв чауумъымшиъдми еадиыц ъыеаыикмшиъдфкф ларлашилмв (чежу). ю\n" +
                "сфеъдмх ъыеаыикмшиъдмх вяиелцх ъмуах (съвъ) юффещниллцх ъму (юъ) ег жемлвыф мъжфуьрфюаыь ыиесмл «еадиылцй\n" +
                "жфяюфялцй деийъие ъыеаыикмшиъдфкф ларлашилмв» (еждъл). ю юфиллф-сфеъдмх ъмуах (юсъ) ъёа\n" +
                "м яещкмх кфъщяаеъыю щжфыеичувиыъв ыиесмл «аыфслав жфяюфялав уфяда ъ чауумъымшиъдмсм жфеанилмв юанлцх еадиыасм»\n" +
                "(жуаеч). флм юфиллф-аясмлмъыеаымюлцх жеияларлашилц пилыефю, яу�� жщлдыфющжеаюуилмв, кещжжмефюфд юффещниллцх ъму жефымюлмда, юфиллф-\n" +
                "сфеъдмх чар, жфеыфю м яе., фъщбиъыюувв жуаюалми ю утчцх еайфлах смефюфкф фдиала ъдецылф, ли юъжуцюав ю лаяюфялфи жфуфнилми.еждъл м\n" +
                "жуаеч жемсилвтыъв дад ъасфъыфвыиуьлф, ыад м ю ъфъыаюи кещжжмефюфд съвъ м еарлфефялцх ъму. сфкщы мсиыь ла юффещнилмм зггидымюлци\n" +
                "ъеияъыюа чфеьчц ъ жефымюфуфяфшлцсм ъмуасм жефымюлмда, ъеияъыюа лачутяилмв, ъюврм\n" +
                "м щжеаюуилмв, лаюмкапмм, юфъжеибилм лиъалдпмфлмефюаллфкф яфъыщжа д еадиылф-вяиелфсщ фещнмт, яещкми еаямфзуидыефллци\n" +
                "юцшмъумыиуьлци м ыихлмшиъдми ъеияъыюа. ъыеаыикмшиъдми ажу вюувтыъв фълфюлфй чфиюфй иямлмпий м щяаелцс\n" +
                "дфсжфлилыфс съвъ м ъфъыфвы ла юффещнилмм юсг ефъъмм, юсъ ъёа, юиумдфчемыалмм, геалпмм м дмыав.\n";

        frequencies4 = new HashMap<>()
        {{
            put('о',0.0989); put('е', 0.0938); put('и', 0.0810);
            put('т', 0.0735); put('н', 0.0627); put('а', 0.0596);
            put('р', 0.0586); put('с', 0.0519); put('в', 0.0502);
            put('я', 0.0400); put('д', 0.0374); put('л', 0.0323);
            put('к', 0.0281); put('м', 0.0247); put('п', 0.0247);
            put('з', 0.0196); put('ы', 0.0187); put('у', 0.0179);
            put('г', 0.0170); put('ч', 0.0170); put('ь', 0.0136);
            put('х', 0.0136); put('й', 0.0111); put('ж', 0.0085);
            put('б', 0.0077); put('ц', 0.0077); put('э', 0.0077);
            put('ф', 0.0077); put('ю', 0.0060); put('ш', 0.0060);
            put('щ', 0.0051); put('ъ', 0.0007); put('ё', 0.0001);
        }};

        testText4 = "чъуэлбх юрбэёдщябжп йдуэл скрёбжхж идёскд, ьвщайрблр ь вжбуэёъвюла скрёбжхж идёскд (си) вжеодвэбжхж крпэрёлпэёлэлрьжхж (d-t)\n" +
                "ъищд. ожувжщявъ ь си ътр ьувжёр ожущр кжуэлтрблс бдквёлэлйбжуэл крщсцeхжус едэрёлдщд (ке, уе. крщсцлрус едэрёлдщн) ь оёжюруур юробжп\n" +
                "ёрдвюлл крщрблс ежхъэ кжуэлхдэяус эреорёдэъён ожёсквд 107°у л кдьщрблр 108…109 дэе., ь гэлм ъущжьлсм ежхъэ оёжлумжклэя эрёежскрёбнр ёрдвюлл.\n" +
                "оёл оёжэрвдблл ёрдвюлл d-э-улбэрид леоъщяубж ьнкрщсаэус\n" +
                "ьнужвжгбрёхрэлйрувлр (14,7 егь) брпэёжбн, вжэжёнр гззрвэльбж ёдуцрощсаэскёд ке.ч. юрбэёдщябжп йдуэл идёскд ��эдщж ьдтбне фдхже ьорёрк оёл\n" +
                "ужьрёфрбуэьжьдблл скрёбжхж жёътлс (сж). ьж-орёьнм, ч. ибдйлэрщябж ъьрщлйльдрэ гззрвэльбжуэя луожщяижьдблс ке. ь йлуэж крщлэрщябнм идёскдм\n" +
                "гззрвэльбжуэя жхёдблйрбд ужуэжсблре вёлэлйбжуэл ке. бдщлйлр тр оёл ч. си «ьбрфблм» эрёежскрёбнм брпэёжбжь крщдрэ ёртле\n" +
                "ухжёдблс ке едщжйъьуэьлэрщябне в рхж ужуэжсбла, д вжщлйруэьж рхж ёдуцрольфлмус скрё ёривж ьжиёдуэдрэ. ьж-ьэжёнм, бдщлйлр ч. ожьнфдрэ ъуэжпйльжуэя\n" +
                "гбрёхжьнкрщрблс си в оёркрэжбдюлл, йэж ожьнфдрэ оёркувдиърежуэя жубжьбнм мдёдвэрёлуэлв идёскд (йэж ь жужчрббжуэл ьдтбж кщс орёьлйбнм\n" +
                "крщлэрщябнм ъищжь уэдклпбжхж эрёежскрёбжхж жёътлс). оёлербрблр ч. эдвтр ьдтбж кщс ожьнфрблс гззрвэльбжуэл сж ь ъущжьлсм ьжикрпуэьлс бд брхж\n" +
                "уёркуэь скрёбжп оёжэльжёдврэбжп жчжёжбн (оёж) ид уйрэ жущдчщрблс йъьуэьлэрщябжуэл си в ьжиблвдацреъ оёл гэже ь ке зжбъ идодикньдацлм\n" +
                "брпэёжбжь.\n";

        frequencies5 = new HashMap<>()
        {{
            put('о', 0.1028); put('и', 0.0818); put('а', 0.0804);
            put('с', 0.0737); put('е', 0.0706); put('т', 0.0656);
            put('н', 0.0609); put('р', 0.0601); put('л', 0.0430);
            put('в', 0.0406); put('к', 0.0349); put('д', 0.0284);
            put('п', 0.0260); put('я', 0.0252); put('г', 0.0235);
            put('м', 0.0219); put('й', 0.0187); put('ы', 0.0179);
            put('ь', 0.0154); put('з', 0.0146); put('б', 0.0138);
            put('у', 0.0122); put('э', 0.0097); put('ц', 0.0073);
            put('ч', 0.0073); put('ю', 0.0065); put('х', 0.0065);
            put('ж', 0.0057); put('щ', 0.0057); put('ш', 0.0041);
            put('ф', 0.0016); put('ъ', 0.0008); put('ё', 0.0001);
        }};

        testText5 = "24 юхпзкиек 1969 т. юэеэк жогхеаэуо йевнхрёеф, югкжоппфх ю еозэдэмонэхы рвтвгвео в пхеоюйевюзеопхпээ крхепвтв веёъэк (рпкв). юйёюзк\n" +
                "ивухх 22 ухз, 18 щок 1992 т. рук юэеээ гюзёйэув г юэуё ювтуоахпэх в гюхвибхщуяшэц тоеопзэкц щотозь. г 1976 т. ифуо вюпвгопо юэеэыюмок\n" +
                "мвщэююэк йв озвщпвы ьпхетээ (юмоь), врпвы эж нхухы мвзвевы ифув\n" +
                "эжёсхпэх гвжщвъпвюзэ юзевэзхучюзго по зхееэзвеээ юзеопф озвщпвыьухмзевюзопнээ (оью). г посоух 1980-ц тт. юэеэыюмок юзвевпо йевгврэуо\n" +
                "йхехтвгвеф ю деопнэхы в юзевэзхучюзгх ахюзэ ьпхетвиувмвг щвшпвюзчя 600 щгз моърфы. йуопэевгоувюч, сзв йхегфы ехомзве иёрхз жойёшхп г 1991 т.\n" +
                "врпомв юрхумо зом э пх ифуо жогхеахпо.пхвицврэщвюзч ювжропэк понэвпоучпвы иожф рук йвртвзвгмэ юйхнэоуэюзвг г виуоюзэ озвщпвы\n" +
                "ьпхетхзэмэ жоюзогэуо юмоь жопкзчюк йвэюмвщ юзеопф, мвзвеок йвюзогэуо иф эююухрвгозхучюмэы ехомзве г юэеэя. г 1991 т. г мэзох йеэ юврхыюзгээ\n" +
                "щотозь ифу йеэвиехзхп щэпэозяепфы эюзвспэм пхызевпвг щвшпвюзчя 30 мгз, мвзвефы ю 1998 т. йеэщхпкхзюк рук йевэжгврюзго юзоиэучпфц эжвзвйвг,\n" +
                "эюйвучжёяшэцюк г щхрэнэпх,о зомъх рук эжёсхпэк пхызевппфц цоеомзхеэюзэм. йоеоуухучпв юмоь йевгврэуэюч йхехтвгвеф ю оетхпзэпвы в\n" +
                "йвмёймх ухтмвгврпвтв эююухрвгозхучюмвтв ехомзвео щвшпвюзчя 10 щгз. врпомв йвр рогухпэхщ юв юзвевпф юао э эжеоэук юрхумо зом э пх\n" +
                "ювюзвкуоюч. г 1995–1999 тт. евююэхы э юэеэхы виюёъроуюк гвйевю юзевэзхучюзго г йвюухрпхы поёспв-эююухрвгозхучюмвтв нхпзео ю\n" +
                "ухтмвгврпфщ крхепфщ ехомзвевщ щвшпвюзчя 25 щгз, о зомъх оью. врпомв йв еожпфщ йеэсэпощ йеомзэсхюмвтв еожгэзэк ьзэ виюёърхпэк пх йвуёсэуэ.\n";
    }

    @Test
    public void task1Test() {
        cryptanalyzer.decrypt(frequncies1, testText1);
    }

    @Test
    public void task2Test() {
        cryptanalyzer.decrypt(frequencies2, testText2);
    }

    @Test
    public void task3Test() {
        cryptanalyzer.decrypt(frequencies3, testText3);
    }

    @Test
    public void task4Test() {
        cryptanalyzer.decrypt(frequencies4, testText4);
    }

    @Test
    public void task5Test() {
        cryptanalyzer.decrypt(frequencies5, testText5);
    }

}
